Merge pull request #14 from flaviofuego/Service-registry
Service registry fully operative
